writing.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-06-03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Writing &amp; literate-programming projects</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"/><link rel="stylesheet" href="/css/site.css"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a class="brand" href="/">Jingtao&nbsp;Xu</a><span class="nav-links"><a href="/about/about.html">About</a><a href="/#services">Work</a><a href="/writing.html">Writing</a><a href="/proof.html">Proof</a><a class="nav-cta" href="/contact.html">Connect</a></span></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Writing &amp; literate-programming projects</h1>
</header><p>
Depth signal, not a blog. Below: my literate-programming projects (code that
<b>is</b> its own documentation), a selected English article, and a dated archive.
</p>
<div id="outline-container-orgf50d26d" class="outline-2">
<h2 id="orgf50d26d">Literate-programming projects</h2>
<div class="outline-text-2" id="text-orgf50d26d">
<p>
I work in a literate style — prose and code together — and I authored the
tooling that makes it work across several languages:
</p>

<ul class="org-ul">
<li><a href="https://github.com/jingtaozf/literate-lisp">literate-lisp</a> (★69) — load Common Lisp code blocks straight from Org files.</li>
<li><a href="https://github.com/jingtaozf/literate-elisp">literate-elisp</a> (★49) — the same for Emacs Lisp; the engine behind my agent docs.</li>
<li><a href="https://github.com/jingtaozf/literate-clojure">literate-clojure</a> (★15) — literate programming for Clojure / ClojureScript.</li>
<li><a href="https://github.com/jingtaozf/literate-smalltalk">literate-smalltalk</a> (★6) — literate programming for Smalltalk.</li>
<li><a href="https://github.com/jingtaozf/s-graphviz">s-graphviz</a> (★26) — an s-expression representation of GraphViz DOT in Common Lisp.</li>
<li><a href="https://github.com/jingtaozf/emacs-agent">emacs-agent</a> — a native Emacs SDK for code agents with org-mode as the interactive UI (literate Emacs Lisp); how I drive AI agents day to day.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfa7efec" class="outline-2">
<h2 id="orgfa7efec">Selected (English)</h2>
<div class="outline-text-2" id="text-orgfa7efec">
<ul class="org-ul">
<li><a href="lisp/literate-programming-in-lisp.html">Literate programming in Lisp dialects</a> (2019) —
how I write code and prose together across Common Lisp, Emacs Lisp and Clojure;
the approach behind the libraries above.</li>
</ul>
</div>
</div>
<div id="outline-container-org694ef9d" class="outline-2">
<h2 id="org694ef9d">Archive (Chinese, 2002–2019)</h2>
<div class="outline-text-2" id="text-org694ef9d">
<p>
Kept for depth — these reinforce the systems / reverse-engineering / Emacs
background behind the AI-agent and security work. Not translated.
</p>

<ul class="org-ul">
<li><a href="lisp/mixlang-in-lisp.html">Common Lisp 与其它语言的集成</a> (2013) — integrating Common Lisp with other languages.</li>
<li><a href="emacs/TheWayIUseEmacs.html">我是如何使用 Emacs 的</a> (2014) — my Emacs workflow (English version planned).</li>
<li><a href="assembly/Nasm.html">NASM 源码阅读笔记</a> (2019) — reading the NASM assembler source.</li>
<li><a href="assembly/Nasm-ds.html">NASM 源码中的数据结构</a> (2003) — data structures in the NASM source.</li>
<li><a href="assembly/vim.html">使用 GVIM 阅读 MASM 代码</a> (2003) — reading MASM code with GVIM.</li>
<li><a href="assembly/subject2001.html">部分改编的汇编代码</a> (2002) — assorted assembly.</li>
<li><a href="assembly/assembly.html">Win32 assembly notes</a> (2002–2003) — early Win32 assembly.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><p>Remote · UTC+8 · fluent English / 中文</p><p><a href="mailto:dev@jingtao.net">dev@jingtao.net</a> · <a href="https://cal.com/jingtaoxu">Book a call</a> · <a href="https://github.com/jingtao-net">github.com/jingtao-net</a></p><p class="fineprint">© Jingtao Xu</p></footer>
</div>
</body>
</html>
